rainer20512/stm32-fw/common/src/dev/xspi_dev.c
/******************************************************************************
 * Abort current operation ( i.e. MemoryMapped or DMA mode and
 * reset functional mode configuration to indirect write mode by default 
 *****************************************************************************/
bool XSpi_Abort(XSpiHandleT *myHandle)
{
    XXSPI_HandleTypeDef *hxspi       = &myHandle->hxspi;
    #if USE_OSPI > 0
        return HAL_OSPI_Abort(hxspi) == HAL_OK;
    #else
        return HAL_QSPI_Abort(hxspi) == HAL_OK;
    #endif
}


///////////////////////////////////////////////////////////////////////////////
// Device functions ///////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
void XSpi_DeInit(const HW_DeviceType *self)
{
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
    XSpiHandleT *myHandle           = adt->myXSpiHandle;  
    XXSPI_HandleTypeDef *hxspi       = &myHandle->hxspi;

    /* DeInit GPIO */
    uint32_t devIdx = GetDevIdx(self);
    GpioAFDeInitAll(devIdx, self->devGpioAF);
  
    /* disable interrupts */
    if (self->devIrqList) HW_SetAllIRQs(self->devIrqList, false);

    /* Disable the DMA, if used */
    const HW_DmaType *dma = self->devDmaRx;

    /* RHB Todo : DMA not yet implemented */
    #if 0
    if(dma) {
      /* De-Initialize the Rx part  */
      HAL_DMA_DeInit(dma->dmaHandle);
      HAL_NVIC_DisableIRQ(dma->dmaIrqNum);
    }
    #else
        UNUSED(dma);
    #endif

    /* Disable QUADSPI/OCTOSPI hardware */
    #if USE_OSPI > 0
        HAL_OSPI_DeInit(hxspi);
    #else
        HAL_QSPI_DeInit(hxspi);
    #endif

    /* To leave a clean state, reset QUAD/OCTOSPI hardware */
    HW_Reset(hxspi->Instance);

    /* disable QUAD/OCTOSPI clock and -if present- OCTOSPI manager*/
    HW_SetHWClock(hxspi->Instance, false);
    #if defined(OCTOSPIM)
        HW_SetHWClock(OCTOSPIM, false);
    #endif
}

#if USE_OSPI > 0
    /**************************************************************************************
     * Incase of OSIP being used, configure the OSPIM IP                                  *  
     * The initialization is always done on that way, that there is no pin swapping       *
     * I.e. OCTOSPI1 uses the dedicated OCTOSPI1-Pins, OCTOSPI2 uses the OCTOSPI2-Pins    * 
     * consumption. So, to use the device, it has to be activated first                   *
     *************************************************************************************/
    static bool OSPI_Configure_OSPIM(const HW_DeviceType *self)
    {
        bool ret;
        XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
        XSpiHandleT *myHandle           = adt->myXSpiHandle;  
        XXSPI_HandleTypeDef *hxspi       = &myHandle->hxspi;
        OSPIM_CfgTypeDef OSPIM_Cfg_Struct;

        
        #if USE_OSPI1 > 0
            /* Configure the OctoSPI IO Manager for OCTOSPI1 */
            OSPIM_Cfg_Struct.ClkPort    = 1;
            OSPIM_Cfg_Struct.NCSPort    = 1;
            OSPIM_Cfg_Struct.DQSPort    = ( adt->bUseDQS ? 1 : 0 );
            OSPIM_Cfg_Struct.IOLowPort  = HAL_OSPIM_IOPORT_1_LOW;
            OSPIM_Cfg_Struct.IOHighPort = ( adt->ospiMode ==  OSPI_OCTO ? HAL_OSPIM_IOPORT_1_HIGH : HAL_OSPIM_IOPORT_NONE );
        #else
            /* Configure the OctoSPI IO Manager for OCTOSPI2 */
            OSPIM_Cfg_Struct.ClkPort    = 2;
            OSPIM_Cfg_Struct.NCSPort    = 2;
            OSPIM_Cfg_Struct.DQSPort    = ( adt->bUseDQS ? 2 : 0 );
            OSPIM_Cfg_Struct.IOLowPort  = HAL_OSPIM_IOPORT_2_LOW;
            OSPIM_Cfg_Struct.IOHighPort = ( adt->ospiMode ==  OSPI_OCTO ? HAL_OSPIM_IOPORT_2_HIGH : HAL_OSPIM_IOPORT_NONE );
        #endif

        ret = HAL_OSPIM_Config(hxspi, &OSPIM_Cfg_Struct, XSPI_TIMEOUT_DEFAULT_VALUE) == HAL_OK;
        if ( !ret ) {
            #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                LOGU_ERROR("Failed to config Octospi-Manager");
            #endif
        }

        return ret;
    }
#endif

/**************************************************************************************
 * Initialize quadrature encoder, i.e. set all GPIO pins and activate all interrupts  *
 * After successful initialization, the device is deactivated to reduce power         *
 * consumption. So, to use the device, it has to be activated first                   *
 *************************************************************************************/
bool XSpi_Init(const HW_DeviceType *self)
{
    bool ret;
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
    XSpiHandleT *myHandle           = adt->myXSpiHandle;  
    XXSPI_HandleTypeDef *hxspi       = &myHandle->hxspi;
    #if USE_OSPI > 0
        hxspi->Instance                 = (OCTOSPI_TypeDef*)self->devBase;
    #else
        hxspi->Instance                 = (QUADSPI_TypeDef*)self->devBase;
    #endif
    /* If deep sleep is supported, setup the deep sleep information block */
    if ( adt->myDsInfo ) {
        myHandle->dsInfo            = adt->myDsInfo;
        myHandle->dsInfo->bIsDeepSleep = false;
        myHandle->dsInfo->bInDsTransit = false;
    } else {
        myHandle->dsInfo            = NULL;    
    }
    myHandle->bAsyncBusy            = false;
    myHandle->bIsMemoryMapped       = false;
    myHandle->bIsInitialized        = false;
    myHandle->clkspeed              = adt->default_speed;

    XSpiClockInit(self, true);

    HW_SetHWClock(hxspi->Instance, true);
    #if defined(OCTOSPIM)
        HW_SetHWClock(OCTOSPIM, true);
    #endif

    HW_Reset(hxspi->Instance);

    uint32_t devIdx = GetDevIdx(self);
    XSpiGpioInitAF(devIdx, self->devGpioAF);

    /* First disable QUADSPI/OCTOSPI hardware */
    #if USE_OSPI > 0
        HAL_OSPI_DeInit(hxspi);
    #else
        HAL_QSPI_DeInit(hxspi);
    #endif

    ret = XSpecific_SpecificInit(self, myHandle, XSpiGetClockSpeed() );
    
    #if USE_OSPI > 0
        if (ret) ret = OSPI_Configure_OSPIM(self);
    #endif

    if ( ret ) {
        if ( self->devIrqList ) {
            /* Configure the NVIC, enable interrupts */
            HW_SetAllIRQs(self->devIrqList, true);
        }

        #if DEBUG_MODE > 0
            XSpi_DumpChipInfo(myHandle->id);
            XSpi_DumpGeometry(&myHandle->geometry);
            if ( console_debuglevel > 2 )  XSpi_DumpStatus(myHandle);
        #endif

 
