rainer20512/stm32-fw/common/src/dev/xspi_dev.c
        /* dma channel initiialization has to be done before every rd or wr operation
           because there is only one dma channel                                      */

        /* If deep sleep is supported, put flash chip into deep sleep mode */
        if ( adt->myDsInfo ) XSpecific_EnterDeepPowerDown(myHandle);
    }


    /* If Initialization was unsuccessful, deactivate all */
    if ( !ret ) XSpi_DeInit(self);

    /* Otherwise set "initialized" flag and return with success */
    myHandle->bIsInitialized = true;
    return ret;
}

/**********************************************************************************
 * Early Init of QSPI Device to enable R/W of config values
 *********************************************************************************/
void XSpi_EarlyInit(void)
{
    int32_t dev_idx;

    /* Init QSPI device */
    dev_idx = AddDevice(&XSPI_DEV, NULL ,NULL);
    DeviceInitByIdx(dev_idx, NULL);
}


/******************************************************************************
 * Check, whether the system may enter Stop 2 mode. 
 * This is the case, if neither transmit nor receive are active
 *****************************************************************************/
bool XSpi_AllowStop(const HW_DeviceType *self)
{
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
#if USE_OSPI > 0 
    return ! (adt->myXSpiHandle->hxspi.Instance->SR & OCTOSPI_SR_BUSY);
#else
    return ! (adt->myXSpiHandle->hxspi.Instance->SR & QUADSPI_SR_BUSY);
#endif
}


/******************************************************************************
 * Callback _before_ frequency changes: To be on the safe side, switch to
 * high performance mode
 *****************************************************************************/
void XSpi_BeforeFrqChange(const HW_DeviceType *self)
{
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
    XSpiHandleT *myHandle           = adt->myXSpiHandle;  

    if ( adt->bHasLPMode) XSpecific_HPerfMode( &myHandle->hxspi, true);
}


/******************************************************************************
 * Callback _after_ frequency changes: Recalculate the QUADSPI hardware 
 * prescaler to a give an operating freqency at or below desired frequency
 *****************************************************************************/
bool XSpi_OnFrqChange(const HW_DeviceType *self)
{
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
    XSpiHandleT *myHandle           = adt->myXSpiHandle;  

    return XSpecific_BasicInit(myHandle, XSpiGetClockSpeed(), adt->default_speed, myHandle->geometry.FlashSize, false );

}

///////////////////////////////////////////////////////////////////////////////
// Global Variables  /////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
#if defined(QUADSPI) && USE_QSPI > 0

    XSpiHandleT QSpi1Handle;

    #if defined(QSPI1_HAS_DS_MODE)
        static XSpiDeepSleepT ds_qspi1;
    #endif

    #ifdef QSPI1_USE_DMA
      static DMA_HandleTypeDef hdma_qspi1;
      static const HW_DmaType dma_qspi = { &hdma_qspi1, QSPI1_DMA };
    #endif

    #if defined( QSPI1_USE_IRQ )
    const HW_IrqList irq_qspi1 = {
        .num = 1,
        .irq = {QSPI1_IRQ },
    };
    #endif

    /* QUADSPI: 6 AF-Pins, NCS, CLK, SIO0, ..., SIO3 */
    static const HW_GpioList_AF gpio_qspi1 = {
        .num  = 6,
        .gpio = { 
            QSPI1_NCS, QSPI1_CLK,
            QSPI1_SI_SIO0, QSPI1_SO_SIO1,
            QSPI1_SIO2, QSPI1_SIO3,
        }
    };


    static const XSpi_AdditionalDataType additional_qspi1 = {
        .myXSpiHandle       = &QSpi1Handle,
        .default_speed      = QSPI1_CLKSPEED,                 
        .myDsInfo           =
            #if defined(QSPI1_HAS_DS_MODE)
                &ds_qspi1,
            #else
                NULL,
            #endif
        .bHasLPMode =
            #if defined(QSPI1_HAS_LP_MODE)
                1,
            #else
                0,
            #endif
    };


const HW_DeviceType HW_QSPI1 = {
    .devName        = XSpiStr,
    .devBase        = QUADSPI,
    .devGpioAF      = &gpio_qspi1,
    .devGpioIO      = NULL,
    .devGpioADC     = NULL,
    .devType        = HW_DEVICE_XSPI,
    .devData        = &additional_qspi1,
    .devIrqList     = 
        #if defined(QSPI1_USE_IRQ) 
            &irq_qspi1,
        #else
            NULL,
        #endif
    /* There is only one dma channel for quadspi, so we assign that  *
     * to .devDmaRx, even it's used for both directions              */
    #if defined(QSPI1_USE_DMA)
        .devDmaRx = &dma_qspi1,
    #else
        .devDmaRx   = NULL,
    #endif
    .devDmaTx       = NULL,         /* .devDmaTx  is never used */
    .Init           = XSpi_Init,
    .DeInit         = XSpi_DeInit,
    .BeforeFrqChange= XSpi_BeforeFrqChange,
    .OnFrqChange    = XSpi_OnFrqChange,
    .AllowStop      = XSpi_AllowStop,
    .OnSleep        = NULL,
    .OnWakeUp       = NULL,
};
#endif /* defined(QUADSPI) && USE_QSPI > 0 */


#if defined(OCTOSPI) && USE_OSPI1 > 0
    XSpiHandleT OSpi1Handle;

    #if defined(OSPI1_HAS_DS_MODE)
        static XSpiDeepSleepT ds_ospi1;
    #endif

    #ifdef OSPI1_USE_DMA
      static DMA_HandleTypeDef hdma_ospi1;
      static const HW_DmaType dma_ospi1 = { &hdma_ospi1, OSPI1_DMA };
    #endif

    #if defined( OSPI1_USE_IRQ )
    const HW_IrqList irq_ospi1 = {
        .num = 1,
        .irq = {OSPI1_IRQ },
    };
    #endif

    /* OCTOSPI: 11 AF-Pins, NCS, CLK, DQS, SIO0, ..., SIO3, SIO4, ..., SIO7 */
    static const HW_GpioList_AF gpio_ospi1 = {
        .gpio = { 
            OSPI1_NCS, OSPI1_CLK, 
        #if defined(OSPI1_USE_DQS)
            OSPI1_DQS, 
            #define GPIO_NUM1       3
        #else
            #define GPIO_NUM1       2
        #endif
            OSPI1_SI_SIO0, OSPI1_SO_SIO1, OSPI1_SIO2, OSPI1_SIO3,
        #if defined(OSPI1_MODE_OCTO)
            OSPI1_SI_SIO4, OSPI1_SO_SIO5, OSPI1_SIO6, OSPI1_SIO7,
            #define GPIO_NUM2       8
        #else
            #define GPIO_NUM2       4
        #endif
        },
        .num = GPIO_NUM1 + GPIO_NUM2,
    };


    static const XSpi_AdditionalDataType additional_ospi1 = {
        .myXSpiHandle       = &OSpi1Handle,
        .default_speed      = OSPI1_CLKSPEED,                 
        .myDsInfo           =
            #if definedOSPI1_HAS_DS_MODE)
                &ds_ospi1,
            #else
                NULL,
            #endif
        .bHasLPMode =
            #if defined(OSPI1_HAS_LP_MODE)
                1,
            #else
                0,
            #endif
    #if USE_OSPI > 0
        .ospiMode =
            #if defined(OSPI1_MODE_OCTO)
                OSPI_OCTO,
            #elif defined((OSPI1_MODE_QUAD)
                OSPI_QUAD,
            #else
                error "Operating mode for OCTOSPI1 not set"
            #endif
        .bUseDQS =
            #if defined(OSPI1_USE_DQS)
                1,
            #else
                0,
            #endif
    #endif
    };


