rainer20512/stm32-fw/common/src/dev/xspi_dev.c
#if USE_OSPI > 0 && ( defined(OSPI1_USE_IRQ) || defined(OSPI2_USE_IRQ) )
    /**
      * @brief  Command completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_OSPI_CmdCpltCallback(OSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("CmdCplt Callback");
        TaskNotify(TASK_XSPI);
    }

    /**
      * @brief  Rx Transfer completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_OSPI_RxCpltCallback(OSPI_HandleTypeDef *hxspi)
    {
      UNUSED(hxspi);
      LOGU_VERBOSE("RxCplt Callback");
      #if USE_OSPI1 > 0
          OSpi1Handle.bAsyncBusy = false;  
          if ( OSpi1Handle.XSpi_RdDoneCB ) OSpi1Handle.XSpi_RdDoneCB(&OSpi1Handle);
      #else
          OSpi2Handle.bAsyncBusy = false;  
          if ( OSpi2Handle.XSpi_RdDoneCB ) OSpi2Handle.XSpi_RdDoneCB(&OSpi2Handle);
       #endif
    }

    /**
      * @brief  Tx Transfer completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_OSPI_TxCpltCallback(OSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("TxCplt Callback");
        TaskNotify(TASK_XSPI);
    }

    /**
      * @brief  Status Match callbacks
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_OSPI_StatusMatchCallback(OSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("StatusMatch Callback");
        TaskNotify(TASK_XSPI);
    }

    void HAL_OSPI_ErrorCallback(OSPI_HandleTypeDef *hxspi)
    {
      UNUSED(hxspi);
      LOGU_VERBOSE("ERROR CALLBACK");
      /* Set error state and trigger next call of SM */
      smData.wrState = STATE_ERROR;
      TaskNotify(TASK_XSPI);
    }
#endif /* USE_OSPI > 0 && ( defined(OSPI1_USE_IRQ) || defined(OSPI2_USE_IRQ) ) */


void task_handle_xspi(uint32_t arg)
{
    UNUSED(arg);
    /* Only one SM may be active at one time, check which */
    if      (wrSM) wrSM();
    else if (erSM) erSM(); 
}

#endif /* if USE_QSPI > 0 || USE_OSPI > 0 */


/**
  * @}
  */


